/* Монопол је игра у којој се играчи крећу по пољима која су постављена
 * у круг. Играчи се увек крећу у смеру казаљке на сату. Претпоставимо
 * да су поља означена редним ројевима који крећу од 0, да су на почетку
 * игре оба играча на том пољу и да се током игре играчи нису кретали унатраг.
 * Ако се зна број поља које је први играч прешао од почетка игре и број
 * поља које је други играч прешао од почетка игре напиши програм који
 * израчунава колико корака први играч треба да направи да би дошао на поље
 * на ком се налази други играч. */

#include<iostream>
using namespace std;


int main(){

    int n, a, b;
    cin >> n >> a >> b;

    int sa_polja = a % n;
    int na_polje = b % n;

    cout << (na_polje >= sa_polja ? (na_polje - sa_polja) : (na_polje - sa_polja + n)) << endl;

    return 0;
}
