/* Деца стоје у кругу и одређују ко ће од њих да жмури тако што изговарају
 * неку разбрајалицу (на пример, еци-пеци-пец). Ако децу обележимо бројевима
 * од 0 до n−1, редом како стоје у кругу, ако је познат број речи (слогова)
 * разбрајалице и ако је познат редни број детета од којег почиње разбрајање,
 * напиши програм који приказује редни број детета које је одабрано да жмури
 * (тј. на коме се разбрајање завршава). */

#include<iostream>
using namespace std;

int main(){
    
    int n, m, a;
    cin >> n >> m >> a;
    
    cout << ((a + (n-1)) % m) << endl;
    
    return 0;
}
