/* Дочепо се мали рата очевога сата. Пошто је још мали, зна да
 * гледа само сатну казаљку. Сат се може навијати тако што се 
 * једним дугметом сатна казаљка помера за један сат унапред 
 * (у смеру кретаља казаљке на сату) а другим дугметом се помера
 * за један сат уназад (у супротном смеру кретања казаљке на сату).
 * Ако се зна позиција а на којој се тренутно налази казаљка, 
 * позиција b на којој рата жели да се нађе, напиши програм који
 * одређује да ли се сат може навити тако што рата притисне 
 * једно од два дугмета тачно k пута. */

#include<iostream>
using namespace std;

int main(){
        
    int a, b, k;
    cin >> a >> b >> k;
    
    k = k%12;
    
    bool moze = false;
    
    if((a+k) % 12 == b){
        moze = true;
        cout << "napred" << endl;
    }
    if((a-k+12) % 12 == b){
        moze = true;
        cout << "nazad" << endl;
    }
    
    if(!moze)
        cout << "ne moze" << endl;
    
    return 0;
}
