/* Ученици гледају два филма у биоскопској сали у којој су седишта
 * распоређена у m врста и n колона (ученика има тачно m·n). Када
 * су гледали први филм, наставници су их распоредили тако што су
 * их ређали по азбучном редоследу попуњавајући врсту по врсту, а
 * када су гледали други филм, поново су били распоређени по азбучном
 * редоследу, али овај пут врсту по врсту. Напиши програм који одређује
 * колико ученика је седело на истом месту током гледања оба филма. */

#include<iostream>
using namespace std;

int nzd(int a, int b){
    while(b != 0){
        int tmp = a % b;
        a = b;
        b = tmp;
    }
    
    return a;
}

int main(){
    
    int m, n;
    cin >> m >> n;
    
    cout << nzd(m-1, n-1) + 1 << endl;
    
    return 0;
}
